# AssetPropertyEnum Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyEnum Class
Members See Also
---
Represents a property of material.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class AssetPropertyEnum : AssetProperty
```

Visual Basic
---
```text
Public Class AssetPropertyEnum _
	Inherits AssetProperty
```

Visual C++
---
```text
public ref class AssetPropertyEnum : public AssetProperty
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AssetProperty Autodesk.Revit.DB.Visual..::..AssetPropertyEnum
# See Also
AssetPropertyEnum Members
Autodesk.Revit.DB.Visual Namespace